## Staging: export 💾
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 14 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                          NAME                                                                           |
|--------|---------------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `module.platform_google_analytics_export.module.platform_google_analytics_export.aws_cloudwatch_event_rule.this`                                        |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.aws_cloudwatch_event_target.this`                                      |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.aws_ecr_lifecycle_policy.this[0]`                                      |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.aws_ecr_repository.this[0]`                                            |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.aws_lambda_permission.this`                                            |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_cloudwatch_log_group.this`                      |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics`  |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0]`                 |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_policy.policies[0]`                         |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role.this`                                  |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0]`      |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0]`  |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0]` |
|        | `module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_lambda_function.this`                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.platform_google_analytics_export.module.platform_google_analytics_export.aws_cloudwatch_event_rule.this will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn                 = (known after apply)
      + description         = "Triggers Lambda platform-google-analytics-export on a schedule"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "platform-google-analytics-export-schedule"
      + name_prefix         = (known after apply)
      + region              = "ca-central-1"
      + schedule_expression = "cron(0 0 1 1 ? 1970)"
      + tags                = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.aws_cloudwatch_event_target.this will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "ca-central-1"
      + rule           = "platform-google-analytics-export-schedule"
      + target_id      = "platform-google-analytics-export"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.aws_ecr_lifecycle_policy.this[0] will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep most recent 10 images"
                      + rulePriority = 10
                      + selection    = {
                          + countNumber = 10
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + region      = "ca-central-1"
      + registry_id = (known after apply)
      + repository  = "platform-google-analytics-export"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "platform-google-analytics-export"
      + region               = "ca-central-1"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.aws_lambda_permission.this will be created
  + resource "aws_lambda_permission" "this" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "platform-google-analytics-export"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ca-central-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge-platform-google-analytics-export"
      + statement_id_prefix = (known after apply)
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.data.aws_iam_policy_document.non_vpc_policies[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "non_vpc_policies" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "CloudWatchAccess"
        }
      + statement {
          + actions   = [
              + "ecr:BatchGetImage",
              + "ecr:GetDownloadUrlForlayer",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ECRImageAccess"
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/platform-google-analytics-export"
      + name_prefix       = (known after apply)
      + region            = "ca-central-1"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_cloudwatch_query_definition.lambda_statistics will be created
  + resource "aws_cloudwatch_query_definition" "lambda_statistics" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws/lambda/platform-google-analytics-export",
        ]
      + name                = "Lambda Statistics / platform-google-analytics-export"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            filter @type = “REPORT”
            | stats
            count(@type) as countInvocations,
            count(@initDuration) as countColdStarts, (count(@initDuration)/count(@type))*100 as percentageColdStarts,
            max(@initDuration) as maxColdStartTime,
            avg(@duration) as averageDuration,
            max(@duration) as maxDuration,
            min(@duration) as minDuration,
            avg(@maxMemoryUsed) as averageMemoryUsed,
            max(@memorySize) as memoryAllocated, (avg(@maxMemoryUsed)/max(@memorySize))*100 as percentageMemoryUsed
            by bin(1h) as timeFrame
        EOT
      + region              = "ca-central-1"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_policy.non_vpc_policies[0] will be created
  + resource "aws_iam_policy" "non_vpc_policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-google-analytics-export_non_vpc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_policy.policies[0] will be created
  + resource "aws_iam_policy" "policies" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "platform-google-analytics-export-0"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cds-data-lake-raw-staging/platform/google-analytics/*"
                      + Sid      = "S3WriteAccess"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = "platform/google-analytics/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::cds-data-lake-raw-staging"
                      + Sid       = "S3ListAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "platform-google-analytics-export"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.attachments[0] will be created
  + resource "aws_iam_role_policy_attachment" "attachments" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-google-analytics-export"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.lambda_insights[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_insights" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLambdaInsightsExecutionRolePolicy"
      + role       = "platform-google-analytics-export"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_iam_role_policy_attachment.non_vpc_policies[0] will be created
  + resource "aws_iam_role_policy_attachment" "non_vpc_policies" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "platform-google-analytics-export"
    }

  # module.platform_google_analytics_export.module.platform_google_analytics_export.module.this_lambda.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "platform-google-analytics-export"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ca-central-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "S3_BUCKET_NAME"   = "cds-data-lake-raw-staging"
              + "S3_EXPORT_PREFIX" = "platform/google-analytics"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config (known after apply)

      + tracing_config {
          + mode = "PassThrough"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + vpc_id                      = (known after apply)
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_cloudwatch_metric_alarm.platform_gc_design_system_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_kms_key.gc_design_system_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_lambda_event_source_mapping.cloudfront_sqs_trigger"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_dlq"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_sqs_queue.cloudfront_processing_queue"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_gc_design_system_export.aws_ssm_parameter.airtable_api_key"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_cloudwatch_metric_alarm.platform_gc_notify_errors"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_policy.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_iam_role.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_notify_export.aws_kms_key.platform_notify_rds_snapshot_exports"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_error_logged"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_support_freshdesk_export.aws_cloudwatch_metric_alarm.platform_support_freshdesk_export_errors"]
WARN - plan.json - main -...
```

</details>
